#include "../solver_engine.hpp"
#include <iostream>
#include <vector>
#include <string>

void RunTestCase(const std::string& testName, const std::vector<std::vector<int>>& inputGrid) {
    std::cout << "\n==================================================\n";
    std::cout << " CHAY KIEM THU: " << testName << "\n";
    std::cout << "==================================================\n";
    
    SolverEngine engine;
    engine.LoadGrid(inputGrid);
    
    std::cout << "Bang Sudoku ban dau:\n";
    engine.PrintGrid();
    
    std::cout << "Qua trinh giai:\n";
    engine.SolveFull();
}

int main() {
    // Đề bài thực tế trích xuất từ hình ảnh của bạn
    // Đề cho Hidden 
    // std::vector<std::vector<int>> realWorldGrid = {
    //     {1, 7, 9,  4, 0, 0,  0, 3, 0},
    //     {6, 5, 0,  0, 1, 0,  7, 0, 0}, // <--- Đã sửa số 7 về đúng cột 6 [1][6]
    //     {8, 2, 0,  0, 0, 7,  6, 0, 0},
        
    //     {5, 6, 0,  0, 0, 0,  8, 7, 0},
    //     {4, 3, 8,  6, 7, 2,  0, 0, 0},
    //     {7, 9, 0,  0, 0, 0,  0, 0, 0},
        
    //     {0, 8, 7,  0, 0, 9,  0, 5, 0},
    //     {9, 0, 5,  0, 8, 0,  3, 0, 7},
    //     {0, 0, 6,  7, 5, 0,  9, 0, 0}
    // };

    // Đề cho X-Wing
    // std::vector<std::vector<int>> realWorldGrid = {
    //     {9, 0, 0,  0, 0, 0,  5, 6, 1},
    //     {0, 0, 6,  0, 1, 0,  7, 9, 3}, 
    //     {7, 1, 0,  0, 9, 6,  2, 4, 8},
        
    //     {6, 0, 0,  0, 2, 1,  4, 7, 9},
    //     {0, 0, 0,  0, 0, 0,  0, 0, 5},
    //     {0, 0, 0,  0, 4, 0,  0, 0, 6},
        
    //     {4, 2, 0,  0, 5, 8,  6, 1, 7},
    //     {5, 0, 7,  1, 0, 2,  0, 0, 4},
    //     {0, 0, 1,  0, 0, 0,  0, 5, 2}
    // };

    // Đề cho XY-Wing
    // std::vector<std::vector<int>> realWorldGrid = {
    //     {5, 8, 0,  0, 6, 2,  9, 1, 0},
    //     {0, 2, 9,  1, 5, 0,  4, 0, 8}, 
    //     {0, 0, 0,  8, 0, 9,  2, 0, 5},
        
    //     {9, 5, 2,  0, 8, 6,  1, 0, 0},
    //     {0, 6, 0,  9, 0, 5,  8, 2, 0},
    //     {0, 0, 8,  2, 0, 0,  5, 9, 6},
        
    //     {8, 9, 6,  5, 3, 1,  7, 4, 2},
    //     {2, 7, 5,  6, 9, 4,  3, 8, 1},
    //     {1, 4, 3,  7, 2, 8,  6, 5, 9}
    // };


    // Đề cho XYZ-Wing
    // std::vector<std::vector<int>> realWorldGrid = {
    //     {0, 9, 2,  0, 0, 1,  7, 5, 0},
    //     {5, 0, 0,  2, 0, 0,  0, 0, 8}, 
    //     {0, 0, 0,  0, 3, 0,  2, 0, 0},
        
    //     {0, 7, 5,  0, 0, 4,  9, 6, 0},
    //     {2, 0, 0,  0, 6, 0,  0, 7, 5},
    //     {0, 6, 9,  7, 0, 0,  0, 3, 0},
        
    //     {0, 0, 8,  0, 9, 0,  0, 2, 0},
    //     {7, 0, 0,  0, 0, 3,  0, 8, 9},
    //     {9, 0, 3,  8, 0, 0,  0, 4, 0}
    // };

    // Đề cho Swordfish
    // std::vector<std::vector<int>> realWorldGrid = {
    //     {9, 0, 8, 7, 3, 5, 1, 0, 0},
    //     {0, 1, 0, 9, 8, 0, 0, 3, 0}, 
    //     {0, 0, 0, 0, 2, 0, 0, 9, 8},
        
    //     {8, 0, 5, 4, 6, 9, 3, 1, 0},
    //     {0, 0, 0, 0, 7, 0, 0, 0, 0},
    //     {0, 4, 3, 2, 5, 0, 9, 0, 0},
        
    //     {2, 5, 0, 0, 0, 0, 0, 0, 0},
    //     {0, 8, 9, 5, 1, 2, 0, 6, 3},
    //     {0, 0, 1, 8, 4, 7, 0, 0, 9}
    // };

    // Đề cho Jellyfish
    std::vector<std::vector<int>> realWorldGrid = {
        {8, 4, 9,  7, 6, 0,  0, 2, 0},
        {2, 1, 6,  0, 0, 5,  4, 7, 0}, 
        {0, 0, 7,  2, 0, 4,  0, 9, 6},
        
        {4, 8, 0,  0, 0, 2,  6, 5, 7},
        {9, 0, 0,  0, 7, 6,  0, 8, 4},
        {7, 6, 0,  4, 5, 8,  9, 1, 0},
        
        {1, 9, 0, 6, 0, 7, 0, 4, 0},
        {6, 7, 4, 5, 0, 9, 0, 3, 0},
        {0, 2, 0, 0, 4, 0, 7, 6, 9}
    };
    RunTestCase("DE BAI THUC TE TU ANH CHUP", realWorldGrid);

    return 0;
}